merlokk/ai-remote/approver-esp32/sdkconfig.defaults
# The committed half of the configuration (CLAUDE.md §10.14.4): the real
# `sdkconfig` is generated by `idf.py set-target esp32c6` and is not committed.

CONFIG_IDF_TARGET="esp32c6"

# 16 MB of flash. The default table assumes 2 or 4 MB, which this one overflows.
CONFIG_ESPTOOLPY_FLASHSIZE_16MB=y
CONFIG_ESPTOOLPY_FLASHSIZE="16MB"

# The layout in partitions.csv — two 2.5 MB OTA slots, the rest storage (§10.12).
CONFIG_PARTITION_TABLE_CUSTOM=y
CONFIG_PARTITION_TABLE_CUSTOM_FILENAME="partitions.csv"
CONFIG_PARTITION_TABLE_FILENAME="partitions.csv"

# C++ without exceptions or RTTI (§10.14.1). Both are already the IDF default;
# they are written down so a menuconfig session cannot flip them by accident.
CONFIG_COMPILER_CXX_EXCEPTIONS=n
CONFIG_COMPILER_CXX_RTTI=n

# The console — logs and the §10.7 command line — goes to the chip's own USB
# Serial/JTAG, which is what the board's USB-C is wired to. There is no UART
# bridge on this board, so leaving the default UART console means a silent port.
CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG=y

# --- LVGL (§10.8, §10.14.1) -------------------------------------------------
# A 1 kHz tick, which is what the LVGL port's timer and the animations below it
# assume. The IDF default is 100 Hz, and at that rate a 5 ms `lv_timer_handler`
# period is a 10 ms one — visible as stutter, and the vendor's example sets this
# for the same reason.
CONFIG_FREERTOS_HZ=1000

# **LVGL's own pool, and this is the one allocator §10.14.1 allows.** Every
# widget comes out of it, it is sized once here, and it does not grow. The seven
# screens of §10.8 are built once at boot and kept, so this is a ceiling rather
# than a working set. If it is ever not enough, the fix is this line — never a
# create-and-delete-per-navigation screen, which is what §10.8.1 forbids for a
# different reason and this makes expensive as well.
#
# **48 KB, and it was the vendor's 64 until the web server could not send a
# packet.** This pool is a static buffer, so every kilobyte of it is a kilobyte
# the heap does not have — and the heap is where the Wi-Fi driver takes its TX
# buffers from (`CONFIG_ESP_WIFI_TX_BUFFER_TYPE=1`, dynamic). At 64 KB the device
# had about 20 KB of heap with the server up, and serving a 2.7 KB page produced
# `wifi:m f null` — the driver failing to allocate a buffer to transmit, which
# from a browser looks like a page that hangs and from the device's own counters
# looks like a file that was served. §10.16 has that diagnosis in full.
#
# What it costs is headroom for widgets: the screens report what they use, and a
# pool that is too small fails loudly at boot in `screens::Init` rather than
# quietly later — which is the reason it is safe to lower.
CONFIG_LV_MEM_SIZE_KILOBYTES=48

# 16-bit colour. The byte order the panel wants is **not** set here: it is the
# `swap_bytes` flag on the LVGL port's display config, so the swap happens in
# the flush path where it can be read next to the driver that needs it.
CONFIG_LV_COLOR_DEPTH_16=y

# The fonts compiled in. Montserrat 14 is LVGL's default and what a label gets
# when nothing says otherwise; 28 and 48 are for the clock of §10.8.2, which is
# the one screen whose whole design is one big number.
CONFIG_LV_FONT_MONTSERRAT_14=y
CONFIG_LV_FONT_MONTSERRAT_28=y
CONFIG_LV_FONT_MONTSERRAT_48=y

# **8 KB for the main task, because the signature does not fit in 3,584.**
# `crypto::Init` derives the device key and runs the self-test from `app_main`,
# and `crypto_sign` uses 4,112 bytes of stack — measured as a high-water mark,
# after the first version of that code panicked here with a stack protection
# fault. The framework's default is 3,584, which was never going to be enough.
#
# It costs nothing after boot: ESP-IDF deletes the main task when `app_main`
# returns, and its stack goes back to the heap with it. Any *other* task that
# signs has to be sized against `crypto::kSignStackBytes` instead, which is what
# that constant is for.
CONFIG_ESP_MAIN_TASK_STACK_SIZE=8192

# --- libsodium (§10.4, §10.6) -----------------------------------------------
# **The SHA-512 underneath Ed25519, and this line is a measurement rather than
# a preference.** §10.6 names this exact switch as a seam that has historically
# produced valid-looking but *wrong* `crypto_sign` output (esp-idf#1044), which
# is the whole reason that section asks for a boot self-test. `y` is libsodium's
# own default here; it is written down because it was checked rather than
# inherited, and because a menuconfig session that flips it is flipping the one
# thing on this device that has to be byte-exact.
#
# Both settings were built, flashed and run against a vector generated by
# `lib/crypto.py`: the public key, the signature and the verify all match either
# way, so the historical bug is not present on ESP-IDF v6.0.2 / esp32c6. What
# separates them is size — `y` costs 134,225 bytes and `n` costs 145,005, and
# `libmbedtls.a` is byte-identical in both because mbedTLS is linked for
# `esp-tls` regardless. So the wrapper saves 10,780 bytes of flash and buys
# nothing back in risk that the self-test does not already cover.
CONFIG_LIBSODIUM_USE_MBEDTLS_SHA=y

# --- What the web server may have in flight (CLAUDE.md §10.16) --------------
#
# **The framework's 5,760 is kept, and this comment is here because lowering it
# was tried and measured and is worse.** The reasoning was sound — three sockets
# able to queue 5,760 bytes each is 17 KB of in-flight data on a device with about
# 20 KB free while the server is up — and the answer at 2,880 was a page that took
# eleven seconds to send 2.4 KB: two segments of window against a peer that ACKs
# every second segment is a round trip per 2,880 bytes, and with a retransmit or
# two it collapses. The heap was worse afterwards rather than better, because a
# slow socket is a socket held open longer.
#
# So the concurrency is bounded where it can be bounded without hurting the wire:
# `web::kMaxSockets` is 2, and the pages are written to be fetched one at a time —
# §10.16 has both, and the number that mattered in the end was **how many requests
# a page makes**, not how big its window is.
